import Image from "next/image";


export default function Intro() {
    return(
            <div className="relative h-screen w-full bg-gradient-to-bl from-slate-800 via-slate-950 to-gray-900 bg-scroll bg-contain overflow-auto">
            <div className="h-[9vh] w-full border-b border-gray-600"></div>
            <div className="h-[340vh] w-full flex justify-center">
                <div className="h-full w-3/4 z-50">
                <div id="T1" className="h-[100vh] w-full">
                    <div className="h-3/5 w-full5">
                        <div className="flex font-sans">
                        <div className="h-3/5 w-1/2">
                            <div className="h-full w-full">
                                <h1 className="text-teal-400 text-4xl font-semibold ">ТАНИЛЦУУЛГА</h1>
                                <p className="text-slate-400 text-base mt-[5vh]">Мэдээллийн технологийн гүнзгийрүүлсэн сургалттай Ерөнхий боловсролын Нэст Эдүкэйшн сургууль нь энэ чиглэлээр Монгол улсад болон АНУ-н Цахиурын хөндийд амжилттай ажиллаж буй залуусын үүсгэл санаачилгаар 2019 онд байгуулагдсан. 2019 онд ахлах ангийн 6 бүлэгтэйгээр үйл ажиллагаагаа эхэлж байсан бол 2020 онд дунд анги, 2021 онд бага ангийн элсэлт авч эхлээд байна. </p>
                            </div>
                        </div>
                        <div className="h-3/5 w-1/2 flex justify-center items-start">
                            <div className="bg-cover h-[22vh] w-[24vh] bg-[url(https://nhs.edu.mn/_next/static/media/rocket.6b297666.svg)]"></div>
                        </div>
                        </div>
                        <div className="h2/5 w-full">
                        <div className="h-1/2 w-full">
                                <h1 className="text-pink-400 text-4xl font-semibold mt-[5vh]">АЛСЫН ХАРАА</h1>
                                <p className="text-slate-400 text-base mt-[5vh]">Хурдацтай өөрчлөгдөж бүй дэлхийн иргэнийг төгөлдөржүүлэхэд Нэст гэр бүл хамтдаа.</p>
                            </div>
                            <div className="h-1/2 w-full">
                                <h1 className="text-yellow-400 text-4xl font-semibold mt-[5vh]">ЭРХЭМ ЗОРИЛГО</h1>
                                <p className="text-slate-400  text-base mt-[5vh]">Технологиор манлайлагч, хүн бүр хүүхдийн төлөө сэтгэлтэй, хамтдаа хөгждөг, бидний дуртай сургууль байна.</p>
                            </div>
                        </div>
                    </div>
                    <div className="h-2/5 w-full   justify-around flex mt-12 gap-x-16 font-sans text-white font-bold text-2xl">
                        <div className="shrink-0 h-[30vh] w-[45vh] relative overflow-hidden backdrop-blur rounded-xl border border-gray-600 bg-gradient-to-b from-white/5 to-primary/5 cursor-pointer">
                        <div class="scale-[600%] absolute bottom-0 right-0 opacity-5 blur-[1px]"><svg width="35" height="25" viewBox="0 0 35 25" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M34.2969 0.703125C34.7656 1.22396 35 1.82292 35 2.5C35 3.17708 34.7656 3.77604 34.2969 4.29688L14.2969 24.2969C13.776 24.7656 13.1771 25 12.5 25C11.8229 25 11.224 24.7656 10.7031 24.2969L0.703125 14.2969C0.234375 13.776 0 13.1771 0 12.5C0 11.8229 0.234375 11.224 0.703125 10.7031C1.22396 10.2344 1.82292 10 2.5 10C3.17708 10 3.77604 10.2344 4.29688 10.7031L12.4219 18.9844L30.7031 0.703125C31.224 0.234375 31.8229 0 32.5 0C33.1771 0 33.776 0.234375 34.2969 0.703125Z" fill="#AC6AFF"></path></svg></div>
                            <div className="h-3/5 w-2/5 m-auto flex justify-center items-center drop-shadow-[0_8px_8px_rgb(128,0,128)] bg-contain bg-[url(https://www.svgrepo.com/show/311788/black-hexagon.svg)]">
                            <svg width="35" height="25" viewBox="0 0 35 25" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M34.2969 0.703125C34.7656 1.22396 35 1.82292 35 2.5C35 3.17708 34.7656 3.77604 34.2969 4.29688L14.2969 24.2969C13.776 24.7656 13.1771 25 12.5 25C11.8229 25 11.224 24.7656 10.7031 24.2969L0.703125 14.2969C0.234375 13.776 0 13.1771 0 12.5C0 11.8229 0.234375 11.224 0.703125 10.7031C1.22396 10.2344 1.82292 10 2.5 10C3.17708 10 3.77604 10.2344 4.29688 10.7031L12.4219 18.9844L30.7031 0.703125C31.224 0.234375 31.8229 0 32.5 0C33.1771 0 33.776 0.234375 34.2969 0.703125Z" fill="#AC6AFF"></path></svg>
                            </div>
                            <div className="h-2/5 w-full flex justify-center items-center">
                                ХҮН ЧАНАР
                            </div>
                        </div>
                        <div className="shrink-0 h-[30vh] w-[45vh] relative overflow-hidden backdrop-blur rounded-xl border border-gray-600 bg-gradient-to-b from-white/5 to-green/5 cursor-pointer">
                        <div class="scale-[600%] absolute bottom-0 right-0 opacity-5 blur-[1px]"><svg width="50" height="25" viewBox="0 0 50 25" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M37.8125 0C41.25 0.104167 44.1146 1.32812 46.4062 3.67188C48.6979 6.01562 49.8958 8.95833 50 12.5C49.8958 16.0417 48.6979 18.9844 46.4062 21.3281C44.1146 23.6719 41.25 24.8958 37.8125 25C34.7917 24.8438 32.1875 23.8021 30 21.875C27.8125 20 26.1458 18.125 25 16.25C23.8542 18.125 22.1875 20 20 21.875C17.8125 23.8021 15.2083 24.8438 12.1875 25C8.75 24.8958 5.88542 23.6719 3.59375 21.3281C1.30208 18.9844 0.104167 16.0417 0 12.5C0.104167 8.95833 1.30208 6.01562 3.59375 3.67188C5.88542 1.32812 8.75 0.104167 12.1875 0C15.2083 0.15625 17.8125 1.19792 20 3.125C22.1875 5 23.8542 6.90104 25 8.82812C26.1458 6.90104 27.8125 5 30 3.125C32.1875 1.19792 34.7917 0.15625 37.8125 0ZM12.1875 21.25C13.9583 21.1979 15.5729 20.625 17.0312 19.5312C18.4375 18.3854 19.6615 17.1354 20.7031 15.7812C21.6927 14.4271 22.4219 13.3333 22.8906 12.5C22.4219 11.6667 21.6927 10.5729 20.7031 9.21875C19.6615 7.86458 18.4375 6.61458 17.0312 5.46875C15.5729 4.375 13.9583 3.80208 12.1875 3.75C9.79167 3.80208 7.8125 4.66146 6.25 6.32812C4.63542 7.94271 3.80208 10 3.75 12.5C3.80208 15 4.63542 17.0573 6.25 18.6719C7.8125 20.3385 9.79167 21.1979 12.1875 21.25ZM37.8125 21.25C40.2083 21.1979 42.1875 20.3385 43.75 18.6719C45.3646 17.0573 46.1979 15 46.25 12.5C46.1979 10 45.3646 7.94271 43.75 6.32812C42.1875 4.66146 40.2083 3.80208 37.8125 3.75C36.0417 3.80208 34.4271 4.375 32.9688 5.46875C31.5625 6.61458 30.3385 7.86458 29.2969 9.21875C28.3073 10.5729 27.5781 11.6667 27.1094 12.5C27.5781 13.3333 28.3073 14.4271 29.2969 15.7812C30.3385 17.1354 31.5625 18.3854 32.9688 19.5312C34.4271 20.625 36.0417 21.1979 37.8125 21.25Z" fill="#2BFFC8"></path></svg></div>
                            <div className="h-3/5 w-2/5 m-auto flex justify-center items-center drop-shadow-[0_8px_8px_rgb(50,168,137)] bg-contain bg-[url(https://www.svgrepo.com/show/311788/black-hexagon.svg)]">
                            <svg width="50" height="25" viewBox="0 0 50 25" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M37.8125 0C41.25 0.104167 44.1146 1.32812 46.4062 3.67188C48.6979 6.01562 49.8958 8.95833 50 12.5C49.8958 16.0417 48.6979 18.9844 46.4062 21.3281C44.1146 23.6719 41.25 24.8958 37.8125 25C34.7917 24.8438 32.1875 23.8021 30 21.875C27.8125 20 26.1458 18.125 25 16.25C23.8542 18.125 22.1875 20 20 21.875C17.8125 23.8021 15.2083 24.8438 12.1875 25C8.75 24.8958 5.88542 23.6719 3.59375 21.3281C1.30208 18.9844 0.104167 16.0417 0 12.5C0.104167 8.95833 1.30208 6.01562 3.59375 3.67188C5.88542 1.32812 8.75 0.104167 12.1875 0C15.2083 0.15625 17.8125 1.19792 20 3.125C22.1875 5 23.8542 6.90104 25 8.82812C26.1458 6.90104 27.8125 5 30 3.125C32.1875 1.19792 34.7917 0.15625 37.8125 0ZM12.1875 21.25C13.9583 21.1979 15.5729 20.625 17.0312 19.5312C18.4375 18.3854 19.6615 17.1354 20.7031 15.7812C21.6927 14.4271 22.4219 13.3333 22.8906 12.5C22.4219 11.6667 21.6927 10.5729 20.7031 9.21875C19.6615 7.86458 18.4375 6.61458 17.0312 5.46875C15.5729 4.375 13.9583 3.80208 12.1875 3.75C9.79167 3.80208 7.8125 4.66146 6.25 6.32812C4.63542 7.94271 3.80208 10 3.75 12.5C3.80208 15 4.63542 17.0573 6.25 18.6719C7.8125 20.3385 9.79167 21.1979 12.1875 21.25ZM37.8125 21.25C40.2083 21.1979 42.1875 20.3385 43.75 18.6719C45.3646 17.0573 46.1979 15 46.25 12.5C46.1979 10 45.3646 7.94271 43.75 6.32812C42.1875 4.66146 40.2083 3.80208 37.8125 3.75C36.0417 3.80208 34.4271 4.375 32.9688 5.46875C31.5625 6.61458 30.3385 7.86458 29.2969 9.21875C28.3073 10.5729 27.5781 11.6667 27.1094 12.5C27.5781 13.3333 28.3073 14.4271 29.2969 15.7812C30.3385 17.1354 31.5625 18.3854 32.9688 19.5312C34.4271 20.625 36.0417 21.1979 37.8125 21.25Z" fill="#2BFFC8"></path></svg>
                            </div>
                            <div className="h-2/5 w-full flex justify-center items-center">ХҮСЭЛ МӨРӨӨДӨЛ</div>
                        </div>
                        <div className="shrink-0 h-[30vh] w-[45vh] relative overflow-hidden backdrop-blur rounded-xl border border-gray-600 bg-gradient-to-b from-white/5 to-blue/5 cursor-pointer">
                        <div class="scale-[600%] absolute bottom-0 right-0 opacity-5 blur-[1px]"><svg width="32" height="41" viewBox="0 0 32 41" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M30.7656 14.0156C31.0781 14.6927 31.0521 15.3438 30.6875 15.9688L14.4375 39.7188C14.0208 40.2396 13.5 40.5 12.875 40.5C12.6146 40.5 12.3802 40.4219 12.1719 40.2656C11.2865 39.849 10.9219 39.1458 11.0781 38.1562L14.2812 23H2.875C2.30208 23 1.83333 22.7917 1.46875 22.375C1.10417 21.9583 0.947917 21.4635 1 20.8906L3.5 2.14062C3.70833 1.09896 4.33333 0.552083 5.375 0.5H19.125C19.75 0.5 20.2708 0.786458 20.6875 1.35938C21.0521 1.88021 21.1042 2.45312 20.8438 3.07812L16.8594 13H29.125C29.8542 13 30.401 13.3385 30.7656 14.0156ZM16.7031 29.7188L25.6094 16.75H14.125C13.4479 16.75 12.9271 16.4896 12.5625 15.9688C12.1979 15.3958 12.1458 14.7969 12.4062 14.1719L16.3906 4.25H7.01562L4.98438 19.25H16.625C17.1979 19.25 17.6927 19.4844 18.1094 19.9531C18.474 20.4219 18.5781 20.9427 18.4219 21.5156L16.7031 29.7188Z" fill="#4DD6FF"></path></svg></div>
                            <div className="h-3/5 w-2/5 m-auto flex justify-center items-center drop-shadow-[0_8px_8px_rgb(9,150,237)] bg-contain bg-[url(https://www.svgrepo.com/show/311788/black-hexagon.svg)]">
                            <svg width="32" height="41" viewBox="0 0 32 41" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M30.7656 14.0156C31.0781 14.6927 31.0521 15.3438 30.6875 15.9688L14.4375 39.7188C14.0208 40.2396 13.5 40.5 12.875 40.5C12.6146 40.5 12.3802 40.4219 12.1719 40.2656C11.2865 39.849 10.9219 39.1458 11.0781 38.1562L14.2812 23H2.875C2.30208 23 1.83333 22.7917 1.46875 22.375C1.10417 21.9583 0.947917 21.4635 1 20.8906L3.5 2.14062C3.70833 1.09896 4.33333 0.552083 5.375 0.5H19.125C19.75 0.5 20.2708 0.786458 20.6875 1.35938C21.0521 1.88021 21.1042 2.45312 20.8438 3.07812L16.8594 13H29.125C29.8542 13 30.401 13.3385 30.7656 14.0156ZM16.7031 29.7188L25.6094 16.75H14.125C13.4479 16.75 12.9271 16.4896 12.5625 15.9688C12.1979 15.3958 12.1458 14.7969 12.4062 14.1719L16.3906 4.25H7.01562L4.98438 19.25H16.625C17.1979 19.25 17.6927 19.4844 18.1094 19.9531C18.474 20.4219 18.5781 20.9427 18.4219 21.5156L16.7031 29.7188Z" fill="#4DD6FF"></path></svg>
                            </div>
                            <div className="h-2/5 w-full flex justify-center items-center">ХИЧЭЭЛ ЗҮТГЭЛ</div>
                        </div>
                    </div>
                </div>
                <div id="T2" className="h-[80vh] w-full">
                    <div className="h-[20vh] w-full text-center mt-[15vh]">
                        <h1 className="text-white font-semibold text-4xl">ТҮҮХЭН</h1>
                        <h1 className="text-amber-400 font-bold text-5xl">ЗАМНАЛ</h1>
                    </div>
                    <div className=" relative h-[10vh] w-full ml-[3vh] flex grid grid grid-rows-1 grid-cols-3 gap-2">
                    <div class="absolute w-full border-t-4 border-dashed border-white/20 top-[4rem]">
                    </div>
                        <div className=" w-[45vh] text-white font-bold text-3xl"><h1>2019</h1></div>
                        <div className="w-[45vh] text-white font-bold text-3xl"><h1>2020</h1></div>
                        <div className="w-[45vh] text-white font-bold text-3xl"><h1>2021</h1></div>
                    </div>
                    <div className="h-2/5 w-full   justify-around flex mt-12 gap-x-16 font-sans text-white font-bold text-2xl">
                        <div className="h-[45vh] w-[45vh] p-3 border border-slate-700 rounded-xl  cursor-pointer hover:backdrop-blur-3xl hover:bg-slate-900 transition-colors ease-linear duration-200">
                            <div className="h-1/2 w-full bg-cover rounded-xl bg-[url(https://m.zangia.mn/s/2307/XL-KFWM0P9-JAAQ00W-O08XY0L-F8.jpg)]"></div>
                            <div className="h-1/2 w-full pt-[3vh]">
                                <h1 className="text-white font-semibold text-lg">АНХНЫ ЭЛСЭЛТ</h1>
                                <p className="text-sm text-slate-400 pt-[2vh]">Nest Education IT School байдуулагдаж анхны элсэлтээ авав.</p>
                            </div>
                        </div>
                        <div className="h-[45vh] w-[45vh] p-3 border border-slate-700 rounded-xl  cursor-pointer hover:backdrop-blur-3xl hover:bg-slate-900 transition-colors ease-linear duration-200">
                        <div className="h-1/2 w-full bg-cover rounded-xl bg-[url(https://scontent.fuln1-1.fna.fbcdn.net/v/t1.6435-9/163627722_2849280051977536_2948972419432520938_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=5f2048&_nc_ohc=Ey-qk-6IoJIAX-CPn_D&_nc_ht=scontent.fuln1-1.fna&oh=00_AfAeKVdJiK_Fx7HQGB_fe_-g_GbQmnB4ayIPHz6w80KWjA&oe=6623EE81)]"></div>
                            <div className="h-1/2w-full pt-[3vh]">
                                <h1 className="text-white font-semibold text-lg">HACKATEEN 2020</h1>
                                <p className="text-sm text-slate-400 pt-[2vh]">Nest Education IT School Монголын хамгийн өндөр шагналын сантай програмчлалын олимпиад болох HackaTeen 2020 уралдааныг амжилттай зохион байгуулав</p>
                            </div>
                        </div>
                        <div className="h-[45vh] w-[45vh] p-3 border border-slate-700 rounded-xl cursor-pointer hover:backdrop-blur-3xl hover:bg-slate-900 transition-colors ease-linear duration-200">
                        <div className="h-1/2 w-full bg-cover rounded-xl bg-[url(https://nhs.edu.mn/assets/images/cover3.jpg)]"></div>
                            <div className="h-1/2w-full pt-[3vh]">
                                <h1 className="text-white font-semibold text-lg">NEST EDUCATION Бага Сургууль</h1>
                                <p className="text-sm text-slate-400 pt-[2vh]">Nest Education IT School бага сургуультай болж үйл ажиллаагаа өргөжүүлэв</p>
                            </div>
                        </div>
                    
                    </div>
                </div>
                <div id="U1" className="h-[140vh] w-full">
                    <div className="h-[20vh] w-full flex justify-center items-center">
                        <div className="font-sans text-4xl text-center">
                        <h1 className="text-white font-semibold">УДИРДЛАГЫН</h1>
                        <h1 className="text-teal-400 font-bold text-5xl">БАГ</h1>
                        </div>
                    </div>
                    <div className="h-[115vh] w-full flex grid grid-rows-2 grid-cols-4 gap-1">
                    <div className="h-[60vh] w-[30vh] rounded-xl cursor-pointer hover:drop-shadow-[0_80px_80px_rgb(191,197,201)] duration-500">
                    <div className="h-1/2 w-full bg-cover rounded-3xl overflow-hidden ">
                            <Image
                                src="https://nhs.edu.mn/_next/static/media/oezak.d82df9f2.jpg"
                                width={315}
                                height={450}
                                className="w-full h-full"
                            ></Image>
                    </div>
                            <div className="h-1/4 w-full pt-[3vh] text-center">
                                <h1 className="text-white font-bold text-xl">Л. Оюун-Эрдэнэ</h1>
                                <p className="text-md text-teal-400 pt-[2vh]">Гүйцэтгэх захирал</p>
                            </div>
                            <div className="h-1/6 w-[25vh] m-auto flex justify-items-center grid grid-rows-1 grid-cols-4">
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.3984 13.75H13.4688V22.5H9.5625V13.75H6.35938V10.1562H9.5625V7.38281C9.5625 4.25781 11.4375 2.5 14.2891 2.5C15.6562 2.5 17.1016 2.77344 17.1016 2.77344V5.85938H15.5C13.9375 5.85938 13.4688 6.79688 13.4688 7.8125V10.1562H16.9453L16.3984 13.75Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.9297 8.4375C19.9297 8.63281 19.9297 8.78906 19.9297 8.98438C19.9297 14.4141 15.8281 20.625 8.28906 20.625C5.94531 20.625 3.79688 19.9609 2 18.7891C2.3125 18.8281 2.625 18.8672 2.97656 18.8672C4.89062 18.8672 6.64844 18.2031 8.05469 17.1094C6.25781 17.0703 4.73438 15.8984 4.22656 14.2578C4.5 14.2969 4.73438 14.3359 5.00781 14.3359C5.35938 14.3359 5.75 14.2578 6.0625 14.1797C4.1875 13.7891 2.78125 12.1484 2.78125 10.1562V10.1172C3.32812 10.4297 3.99219 10.5859 4.65625 10.625C3.52344 9.88281 2.82031 8.63281 2.82031 7.22656C2.82031 6.44531 3.01562 5.74219 3.36719 5.15625C5.39844 7.61719 8.44531 9.25781 11.8438 9.45312C11.7656 9.14062 11.7266 8.82812 11.7266 8.51562C11.7266 6.25 13.5625 4.41406 15.8281 4.41406C17 4.41406 18.0547 4.88281 18.8359 5.70312C19.7344 5.50781 20.6328 5.15625 21.4141 4.6875C21.1016 5.66406 20.4766 6.44531 19.6172 6.95312C20.4375 6.875 21.2578 6.64062 21.9609 6.32812C21.4141 7.14844 20.7109 7.85156 19.9297 8.4375Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.75 8.00781C14.2109 8.00781 16.2422 10.0391 16.2422 12.5C16.2422 15 14.2109 16.9922 11.75 16.9922C9.25 16.9922 7.25781 15 7.25781 12.5C7.25781 10.0391 9.25 8.00781 11.75 8.00781ZM11.75 15.4297C13.3516 15.4297 14.6406 14.1406 14.6406 12.5C14.6406 10.8984 13.3516 9.60938 11.75 9.60938C10.1094 9.60938 8.82031 10.8984 8.82031 12.5C8.82031 14.1406 10.1484 15.4297 11.75 15.4297ZM17.4531 7.85156C17.4531 7.26562 16.9844 6.79688 16.3984 6.79688C15.8125 6.79688 15.3438 7.26562 15.3438 7.85156C15.3438 8.4375 15.8125 8.90625 16.3984 8.90625C16.9844 8.90625 17.4531 8.4375 17.4531 7.85156ZM20.4219 8.90625C20.5 10.3516 20.5 14.6875 20.4219 16.1328C20.3438 17.5391 20.0312 18.75 19.0156 19.8047C18 20.8203 16.75 21.1328 15.3438 21.2109C13.8984 21.2891 9.5625 21.2891 8.11719 21.2109C6.71094 21.1328 5.5 20.8203 4.44531 19.8047C3.42969 18.75 3.11719 17.5391 3.03906 16.1328C2.96094 14.6875 2.96094 10.3516 3.03906 8.90625C3.11719 7.5 3.42969 6.25 4.44531 5.23438C5.5 4.21875 6.71094 3.90625 8.11719 3.82812C9.5625 3.75 13.8984 3.75 15.3438 3.82812C16.75 3.90625 18 4.21875 19.0156 5.23438C20.0312 6.25 20.3438 7.5 20.4219 8.90625ZM18.5469 17.6562C19.0156 16.5234 18.8984 13.7891 18.8984 12.5C18.8984 11.25 19.0156 8.51562 18.5469 7.34375C18.2344 6.60156 17.6484 5.97656 16.9062 5.70312C15.7344 5.23438 13 5.35156 11.75 5.35156C10.4609 5.35156 7.72656 5.23438 6.59375 5.70312C5.8125 6.01562 5.22656 6.60156 4.91406 7.34375C4.44531 8.51562 4.5625 11.25 4.5625 12.5C4.5625 13.7891 4.44531 16.5234 4.91406 17.6562C5.22656 18.4375 5.8125 19.0234 6.59375 19.3359C7.72656 19.8047 10.4609 19.6875 11.75 19.6875C13 19.6875 15.7344 19.8047 16.9062 19.3359C17.6484 19.0234 18.2734 18.4375 18.5469 17.6562Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.5 5C20.2031 5.02604 20.7891 5.27344 21.2578 5.74219C21.7266 6.21094 21.974 6.79688 22 7.5V17.5C21.974 18.2031 21.7266 18.7891 21.2578 19.2578C20.7891 19.7266 20.2031 19.974 19.5 20H4.5C3.79688 19.974 3.21094 19.7266 2.74219 19.2578C2.27344 18.7891 2.02604 18.2031 2 17.5V7.5C2.02604 6.79688 2.27344 6.21094 2.74219 5.74219C3.21094 5.27344 3.79688 5.02604 4.5 5H19.5ZM4.5 6.875C4.10938 6.90104 3.90104 7.10938 3.875 7.5V8.35938L10.3984 13.75C10.8672 14.1406 11.401 14.3359 12 14.3359C12.599 14.3359 13.1328 14.1406 13.6016 13.75L20.125 8.35938V7.5C20.099 7.10938 19.8906 6.90104 19.5 6.875H4.5ZM19.5 18.125C19.8906 18.099 20.099 17.8906 20.125 17.5V10.8203L14.8125 15.2344C13.9792 15.9115 13.0417 16.25 12 16.25C10.9583 16.25 10.0208 15.9115 9.1875 15.2344L3.875 10.8203V17.5C3.90104 17.8906 4.10938 18.099 4.5 18.125H19.5Z" fill="white"></path></svg>
                                </div>
                            </div>
                    </div>
                    <div className="h-[60vh] w-[30vh] rounded-xl cursor-pointer hover:drop-shadow-[0_80px_80px_rgb(191,197,201)] duration-500">
                    <div className="h-1/2 w-full bg-cover rounded-3xl overflow-hidden">
                    <Image
                                src="https://nhs.edu.mn/_next/static/media/zaya-min.aa88f995.jpg"
                                width={315}
                                height={450}
                                className="w-full h-full"
                            ></Image>
                    </div>
                            <div className="h-1/4 w-full pt-[3vh] text-center">
                                <h1 className="text-white font-bold text-xl">Г. Төмөрзаяа</h1>
                                <p className="text-md text-teal-400 pt-[2vh]">Бага, дунд сургуулийн захирал</p>
                            </div>
                            <div className="h-1/6 w-[25vh] m-auto flex justify-items-center grid grid-rows-1 grid-cols-4">
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.3984 13.75H13.4688V22.5H9.5625V13.75H6.35938V10.1562H9.5625V7.38281C9.5625 4.25781 11.4375 2.5 14.2891 2.5C15.6562 2.5 17.1016 2.77344 17.1016 2.77344V5.85938H15.5C13.9375 5.85938 13.4688 6.79688 13.4688 7.8125V10.1562H16.9453L16.3984 13.75Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.9297 8.4375C19.9297 8.63281 19.9297 8.78906 19.9297 8.98438C19.9297 14.4141 15.8281 20.625 8.28906 20.625C5.94531 20.625 3.79688 19.9609 2 18.7891C2.3125 18.8281 2.625 18.8672 2.97656 18.8672C4.89062 18.8672 6.64844 18.2031 8.05469 17.1094C6.25781 17.0703 4.73438 15.8984 4.22656 14.2578C4.5 14.2969 4.73438 14.3359 5.00781 14.3359C5.35938 14.3359 5.75 14.2578 6.0625 14.1797C4.1875 13.7891 2.78125 12.1484 2.78125 10.1562V10.1172C3.32812 10.4297 3.99219 10.5859 4.65625 10.625C3.52344 9.88281 2.82031 8.63281 2.82031 7.22656C2.82031 6.44531 3.01562 5.74219 3.36719 5.15625C5.39844 7.61719 8.44531 9.25781 11.8438 9.45312C11.7656 9.14062 11.7266 8.82812 11.7266 8.51562C11.7266 6.25 13.5625 4.41406 15.8281 4.41406C17 4.41406 18.0547 4.88281 18.8359 5.70312C19.7344 5.50781 20.6328 5.15625 21.4141 4.6875C21.1016 5.66406 20.4766 6.44531 19.6172 6.95312C20.4375 6.875 21.2578 6.64062 21.9609 6.32812C21.4141 7.14844 20.7109 7.85156 19.9297 8.4375Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.75 8.00781C14.2109 8.00781 16.2422 10.0391 16.2422 12.5C16.2422 15 14.2109 16.9922 11.75 16.9922C9.25 16.9922 7.25781 15 7.25781 12.5C7.25781 10.0391 9.25 8.00781 11.75 8.00781ZM11.75 15.4297C13.3516 15.4297 14.6406 14.1406 14.6406 12.5C14.6406 10.8984 13.3516 9.60938 11.75 9.60938C10.1094 9.60938 8.82031 10.8984 8.82031 12.5C8.82031 14.1406 10.1484 15.4297 11.75 15.4297ZM17.4531 7.85156C17.4531 7.26562 16.9844 6.79688 16.3984 6.79688C15.8125 6.79688 15.3438 7.26562 15.3438 7.85156C15.3438 8.4375 15.8125 8.90625 16.3984 8.90625C16.9844 8.90625 17.4531 8.4375 17.4531 7.85156ZM20.4219 8.90625C20.5 10.3516 20.5 14.6875 20.4219 16.1328C20.3438 17.5391 20.0312 18.75 19.0156 19.8047C18 20.8203 16.75 21.1328 15.3438 21.2109C13.8984 21.2891 9.5625 21.2891 8.11719 21.2109C6.71094 21.1328 5.5 20.8203 4.44531 19.8047C3.42969 18.75 3.11719 17.5391 3.03906 16.1328C2.96094 14.6875 2.96094 10.3516 3.03906 8.90625C3.11719 7.5 3.42969 6.25 4.44531 5.23438C5.5 4.21875 6.71094 3.90625 8.11719 3.82812C9.5625 3.75 13.8984 3.75 15.3438 3.82812C16.75 3.90625 18 4.21875 19.0156 5.23438C20.0312 6.25 20.3438 7.5 20.4219 8.90625ZM18.5469 17.6562C19.0156 16.5234 18.8984 13.7891 18.8984 12.5C18.8984 11.25 19.0156 8.51562 18.5469 7.34375C18.2344 6.60156 17.6484 5.97656 16.9062 5.70312C15.7344 5.23438 13 5.35156 11.75 5.35156C10.4609 5.35156 7.72656 5.23438 6.59375 5.70312C5.8125 6.01562 5.22656 6.60156 4.91406 7.34375C4.44531 8.51562 4.5625 11.25 4.5625 12.5C4.5625 13.7891 4.44531 16.5234 4.91406 17.6562C5.22656 18.4375 5.8125 19.0234 6.59375 19.3359C7.72656 19.8047 10.4609 19.6875 11.75 19.6875C13 19.6875 15.7344 19.8047 16.9062 19.3359C17.6484 19.0234 18.2734 18.4375 18.5469 17.6562Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.5 5C20.2031 5.02604 20.7891 5.27344 21.2578 5.74219C21.7266 6.21094 21.974 6.79688 22 7.5V17.5C21.974 18.2031 21.7266 18.7891 21.2578 19.2578C20.7891 19.7266 20.2031 19.974 19.5 20H4.5C3.79688 19.974 3.21094 19.7266 2.74219 19.2578C2.27344 18.7891 2.02604 18.2031 2 17.5V7.5C2.02604 6.79688 2.27344 6.21094 2.74219 5.74219C3.21094 5.27344 3.79688 5.02604 4.5 5H19.5ZM4.5 6.875C4.10938 6.90104 3.90104 7.10938 3.875 7.5V8.35938L10.3984 13.75C10.8672 14.1406 11.401 14.3359 12 14.3359C12.599 14.3359 13.1328 14.1406 13.6016 13.75L20.125 8.35938V7.5C20.099 7.10938 19.8906 6.90104 19.5 6.875H4.5ZM19.5 18.125C19.8906 18.099 20.099 17.8906 20.125 17.5V10.8203L14.8125 15.2344C13.9792 15.9115 13.0417 16.25 12 16.25C10.9583 16.25 10.0208 15.9115 9.1875 15.2344L3.875 10.8203V17.5C3.90104 17.8906 4.10938 18.099 4.5 18.125H19.5Z" fill="white"></path></svg>
                                </div>
                            </div>
                    </div>
                    <div className="h-[60vh] w-[30vh] rounded-xl cursor-pointer hover:drop-shadow-[0_80px_80px_rgb(191,197,201)] duration-500">
                    <div className="h-1/2 w-full bg-cover rounded-3xl overflow-hidden">
                    <Image
                                src="https://nhs.edu.mn/_next/static/media/sodod-min.489458f0.jpg"
                                width={315}
                                height={450}
                                className="w-full h-full"
                            ></Image>
                    </div>
                            <div className="h-1/4 w-full pt-[3vh] text-center">
                                <h1 className="text-white font-bold text-xl">Б. Сод-Од</h1>
                                <p className="text-md text-teal-400 pt-[2vh]">Ахлах сургуулийн захирал & CTO</p>
                            </div>
                            <div className="h-1/6 w-[25vh] m-auto flex justify-items-center grid grid-rows-1 grid-cols-4">
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.3984 13.75H13.4688V22.5H9.5625V13.75H6.35938V10.1562H9.5625V7.38281C9.5625 4.25781 11.4375 2.5 14.2891 2.5C15.6562 2.5 17.1016 2.77344 17.1016 2.77344V5.85938H15.5C13.9375 5.85938 13.4688 6.79688 13.4688 7.8125V10.1562H16.9453L16.3984 13.75Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.9297 8.4375C19.9297 8.63281 19.9297 8.78906 19.9297 8.98438C19.9297 14.4141 15.8281 20.625 8.28906 20.625C5.94531 20.625 3.79688 19.9609 2 18.7891C2.3125 18.8281 2.625 18.8672 2.97656 18.8672C4.89062 18.8672 6.64844 18.2031 8.05469 17.1094C6.25781 17.0703 4.73438 15.8984 4.22656 14.2578C4.5 14.2969 4.73438 14.3359 5.00781 14.3359C5.35938 14.3359 5.75 14.2578 6.0625 14.1797C4.1875 13.7891 2.78125 12.1484 2.78125 10.1562V10.1172C3.32812 10.4297 3.99219 10.5859 4.65625 10.625C3.52344 9.88281 2.82031 8.63281 2.82031 7.22656C2.82031 6.44531 3.01562 5.74219 3.36719 5.15625C5.39844 7.61719 8.44531 9.25781 11.8438 9.45312C11.7656 9.14062 11.7266 8.82812 11.7266 8.51562C11.7266 6.25 13.5625 4.41406 15.8281 4.41406C17 4.41406 18.0547 4.88281 18.8359 5.70312C19.7344 5.50781 20.6328 5.15625 21.4141 4.6875C21.1016 5.66406 20.4766 6.44531 19.6172 6.95312C20.4375 6.875 21.2578 6.64062 21.9609 6.32812C21.4141 7.14844 20.7109 7.85156 19.9297 8.4375Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.75 8.00781C14.2109 8.00781 16.2422 10.0391 16.2422 12.5C16.2422 15 14.2109 16.9922 11.75 16.9922C9.25 16.9922 7.25781 15 7.25781 12.5C7.25781 10.0391 9.25 8.00781 11.75 8.00781ZM11.75 15.4297C13.3516 15.4297 14.6406 14.1406 14.6406 12.5C14.6406 10.8984 13.3516 9.60938 11.75 9.60938C10.1094 9.60938 8.82031 10.8984 8.82031 12.5C8.82031 14.1406 10.1484 15.4297 11.75 15.4297ZM17.4531 7.85156C17.4531 7.26562 16.9844 6.79688 16.3984 6.79688C15.8125 6.79688 15.3438 7.26562 15.3438 7.85156C15.3438 8.4375 15.8125 8.90625 16.3984 8.90625C16.9844 8.90625 17.4531 8.4375 17.4531 7.85156ZM20.4219 8.90625C20.5 10.3516 20.5 14.6875 20.4219 16.1328C20.3438 17.5391 20.0312 18.75 19.0156 19.8047C18 20.8203 16.75 21.1328 15.3438 21.2109C13.8984 21.2891 9.5625 21.2891 8.11719 21.2109C6.71094 21.1328 5.5 20.8203 4.44531 19.8047C3.42969 18.75 3.11719 17.5391 3.03906 16.1328C2.96094 14.6875 2.96094 10.3516 3.03906 8.90625C3.11719 7.5 3.42969 6.25 4.44531 5.23438C5.5 4.21875 6.71094 3.90625 8.11719 3.82812C9.5625 3.75 13.8984 3.75 15.3438 3.82812C16.75 3.90625 18 4.21875 19.0156 5.23438C20.0312 6.25 20.3438 7.5 20.4219 8.90625ZM18.5469 17.6562C19.0156 16.5234 18.8984 13.7891 18.8984 12.5C18.8984 11.25 19.0156 8.51562 18.5469 7.34375C18.2344 6.60156 17.6484 5.97656 16.9062 5.70312C15.7344 5.23438 13 5.35156 11.75 5.35156C10.4609 5.35156 7.72656 5.23438 6.59375 5.70312C5.8125 6.01562 5.22656 6.60156 4.91406 7.34375C4.44531 8.51562 4.5625 11.25 4.5625 12.5C4.5625 13.7891 4.44531 16.5234 4.91406 17.6562C5.22656 18.4375 5.8125 19.0234 6.59375 19.3359C7.72656 19.8047 10.4609 19.6875 11.75 19.6875C13 19.6875 15.7344 19.8047 16.9062 19.3359C17.6484 19.0234 18.2734 18.4375 18.5469 17.6562Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.5 5C20.2031 5.02604 20.7891 5.27344 21.2578 5.74219C21.7266 6.21094 21.974 6.79688 22 7.5V17.5C21.974 18.2031 21.7266 18.7891 21.2578 19.2578C20.7891 19.7266 20.2031 19.974 19.5 20H4.5C3.79688 19.974 3.21094 19.7266 2.74219 19.2578C2.27344 18.7891 2.02604 18.2031 2 17.5V7.5C2.02604 6.79688 2.27344 6.21094 2.74219 5.74219C3.21094 5.27344 3.79688 5.02604 4.5 5H19.5ZM4.5 6.875C4.10938 6.90104 3.90104 7.10938 3.875 7.5V8.35938L10.3984 13.75C10.8672 14.1406 11.401 14.3359 12 14.3359C12.599 14.3359 13.1328 14.1406 13.6016 13.75L20.125 8.35938V7.5C20.099 7.10938 19.8906 6.90104 19.5 6.875H4.5ZM19.5 18.125C19.8906 18.099 20.099 17.8906 20.125 17.5V10.8203L14.8125 15.2344C13.9792 15.9115 13.0417 16.25 12 16.25C10.9583 16.25 10.0208 15.9115 9.1875 15.2344L3.875 10.8203V17.5C3.90104 17.8906 4.10938 18.099 4.5 18.125H19.5Z" fill="white"></path></svg>
                                </div>
                            </div>
                    </div>
                    <div className="h-[60vh] w-[30vh] rounded-xl cursor-pointer hover:drop-shadow-[0_80px_80px_rgb(191,197,201)] duration-500">
                    <div className="h-1/2 w-full bg-cover rounded-3xl overflow-hidden">
                    <Image
                                src="https://nhs.edu.mn/_next/static/media/baasankhuu-min.e14bd24a.jpg"
                                width={315}
                                height={450}
                                className="w-full h-full"
                            ></Image>
                    </div>
                            <div className="h-1/4 w-full pt-[3vh] text-center">
                                <h1 className="text-white font-bold text-xl">Д. Баасанхүү</h1>
                                <p className="text-md text-teal-400 pt-[2vh]">Санхүү, үйл ажиллагаа эрхэлсэн захирал</p>
                            </div>
                            <div className="h-1/6 w-[25vh] m-auto flex justify-items-center grid grid-rows-1 grid-cols-4">
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.3984 13.75H13.4688V22.5H9.5625V13.75H6.35938V10.1562H9.5625V7.38281C9.5625 4.25781 11.4375 2.5 14.2891 2.5C15.6562 2.5 17.1016 2.77344 17.1016 2.77344V5.85938H15.5C13.9375 5.85938 13.4688 6.79688 13.4688 7.8125V10.1562H16.9453L16.3984 13.75Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.9297 8.4375C19.9297 8.63281 19.9297 8.78906 19.9297 8.98438C19.9297 14.4141 15.8281 20.625 8.28906 20.625C5.94531 20.625 3.79688 19.9609 2 18.7891C2.3125 18.8281 2.625 18.8672 2.97656 18.8672C4.89062 18.8672 6.64844 18.2031 8.05469 17.1094C6.25781 17.0703 4.73438 15.8984 4.22656 14.2578C4.5 14.2969 4.73438 14.3359 5.00781 14.3359C5.35938 14.3359 5.75 14.2578 6.0625 14.1797C4.1875 13.7891 2.78125 12.1484 2.78125 10.1562V10.1172C3.32812 10.4297 3.99219 10.5859 4.65625 10.625C3.52344 9.88281 2.82031 8.63281 2.82031 7.22656C2.82031 6.44531 3.01562 5.74219 3.36719 5.15625C5.39844 7.61719 8.44531 9.25781 11.8438 9.45312C11.7656 9.14062 11.7266 8.82812 11.7266 8.51562C11.7266 6.25 13.5625 4.41406 15.8281 4.41406C17 4.41406 18.0547 4.88281 18.8359 5.70312C19.7344 5.50781 20.6328 5.15625 21.4141 4.6875C21.1016 5.66406 20.4766 6.44531 19.6172 6.95312C20.4375 6.875 21.2578 6.64062 21.9609 6.32812C21.4141 7.14844 20.7109 7.85156 19.9297 8.4375Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.75 8.00781C14.2109 8.00781 16.2422 10.0391 16.2422 12.5C16.2422 15 14.2109 16.9922 11.75 16.9922C9.25 16.9922 7.25781 15 7.25781 12.5C7.25781 10.0391 9.25 8.00781 11.75 8.00781ZM11.75 15.4297C13.3516 15.4297 14.6406 14.1406 14.6406 12.5C14.6406 10.8984 13.3516 9.60938 11.75 9.60938C10.1094 9.60938 8.82031 10.8984 8.82031 12.5C8.82031 14.1406 10.1484 15.4297 11.75 15.4297ZM17.4531 7.85156C17.4531 7.26562 16.9844 6.79688 16.3984 6.79688C15.8125 6.79688 15.3438 7.26562 15.3438 7.85156C15.3438 8.4375 15.8125 8.90625 16.3984 8.90625C16.9844 8.90625 17.4531 8.4375 17.4531 7.85156ZM20.4219 8.90625C20.5 10.3516 20.5 14.6875 20.4219 16.1328C20.3438 17.5391 20.0312 18.75 19.0156 19.8047C18 20.8203 16.75 21.1328 15.3438 21.2109C13.8984 21.2891 9.5625 21.2891 8.11719 21.2109C6.71094 21.1328 5.5 20.8203 4.44531 19.8047C3.42969 18.75 3.11719 17.5391 3.03906 16.1328C2.96094 14.6875 2.96094 10.3516 3.03906 8.90625C3.11719 7.5 3.42969 6.25 4.44531 5.23438C5.5 4.21875 6.71094 3.90625 8.11719 3.82812C9.5625 3.75 13.8984 3.75 15.3438 3.82812C16.75 3.90625 18 4.21875 19.0156 5.23438C20.0312 6.25 20.3438 7.5 20.4219 8.90625ZM18.5469 17.6562C19.0156 16.5234 18.8984 13.7891 18.8984 12.5C18.8984 11.25 19.0156 8.51562 18.5469 7.34375C18.2344 6.60156 17.6484 5.97656 16.9062 5.70312C15.7344 5.23438 13 5.35156 11.75 5.35156C10.4609 5.35156 7.72656 5.23438 6.59375 5.70312C5.8125 6.01562 5.22656 6.60156 4.91406 7.34375C4.44531 8.51562 4.5625 11.25 4.5625 12.5C4.5625 13.7891 4.44531 16.5234 4.91406 17.6562C5.22656 18.4375 5.8125 19.0234 6.59375 19.3359C7.72656 19.8047 10.4609 19.6875 11.75 19.6875C13 19.6875 15.7344 19.8047 16.9062 19.3359C17.6484 19.0234 18.2734 18.4375 18.5469 17.6562Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.5 5C20.2031 5.02604 20.7891 5.27344 21.2578 5.74219C21.7266 6.21094 21.974 6.79688 22 7.5V17.5C21.974 18.2031 21.7266 18.7891 21.2578 19.2578C20.7891 19.7266 20.2031 19.974 19.5 20H4.5C3.79688 19.974 3.21094 19.7266 2.74219 19.2578C2.27344 18.7891 2.02604 18.2031 2 17.5V7.5C2.02604 6.79688 2.27344 6.21094 2.74219 5.74219C3.21094 5.27344 3.79688 5.02604 4.5 5H19.5ZM4.5 6.875C4.10938 6.90104 3.90104 7.10938 3.875 7.5V8.35938L10.3984 13.75C10.8672 14.1406 11.401 14.3359 12 14.3359C12.599 14.3359 13.1328 14.1406 13.6016 13.75L20.125 8.35938V7.5C20.099 7.10938 19.8906 6.90104 19.5 6.875H4.5ZM19.5 18.125C19.8906 18.099 20.099 17.8906 20.125 17.5V10.8203L14.8125 15.2344C13.9792 15.9115 13.0417 16.25 12 16.25C10.9583 16.25 10.0208 15.9115 9.1875 15.2344L3.875 10.8203V17.5C3.90104 17.8906 4.10938 18.099 4.5 18.125H19.5Z" fill="white"></path></svg>
                                </div>
                            </div>
                    </div>
                    <div className="h-[60vh] w-[30vh] rounded-xl cursor-pointer hover:drop-shadow-[0_80px_80px_rgb(191,197,201)] duration-500">
                    <div className="h-1/2 w-full bg-cover rounded-3xl overflow-hidden">
                    <Image
                                src="https://nhs.edu.mn/_next/static/media/baigalkhuu-min.c6ea3f8a.jpg"
                                width={315}
                                height={450}
                                className="w-full h-full"
                            ></Image>
                    </div>
                            <div className="h-1/4 w-full pt-[3vh] text-center">
                                <h1 className="text-white font-bold text-xl">Б. Байгальхүү</h1>
                                <p className="text-md text-teal-400 pt-[2vh]">Хүний нөөц эрхэлсэн захирал</p>
                            </div>
                            <div className="h-1/6 w-[25vh] m-auto flex justify-items-center grid grid-rows-1 grid-cols-4">
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.3984 13.75H13.4688V22.5H9.5625V13.75H6.35938V10.1562H9.5625V7.38281C9.5625 4.25781 11.4375 2.5 14.2891 2.5C15.6562 2.5 17.1016 2.77344 17.1016 2.77344V5.85938H15.5C13.9375 5.85938 13.4688 6.79688 13.4688 7.8125V10.1562H16.9453L16.3984 13.75Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.9297 8.4375C19.9297 8.63281 19.9297 8.78906 19.9297 8.98438C19.9297 14.4141 15.8281 20.625 8.28906 20.625C5.94531 20.625 3.79688 19.9609 2 18.7891C2.3125 18.8281 2.625 18.8672 2.97656 18.8672C4.89062 18.8672 6.64844 18.2031 8.05469 17.1094C6.25781 17.0703 4.73438 15.8984 4.22656 14.2578C4.5 14.2969 4.73438 14.3359 5.00781 14.3359C5.35938 14.3359 5.75 14.2578 6.0625 14.1797C4.1875 13.7891 2.78125 12.1484 2.78125 10.1562V10.1172C3.32812 10.4297 3.99219 10.5859 4.65625 10.625C3.52344 9.88281 2.82031 8.63281 2.82031 7.22656C2.82031 6.44531 3.01562 5.74219 3.36719 5.15625C5.39844 7.61719 8.44531 9.25781 11.8438 9.45312C11.7656 9.14062 11.7266 8.82812 11.7266 8.51562C11.7266 6.25 13.5625 4.41406 15.8281 4.41406C17 4.41406 18.0547 4.88281 18.8359 5.70312C19.7344 5.50781 20.6328 5.15625 21.4141 4.6875C21.1016 5.66406 20.4766 6.44531 19.6172 6.95312C20.4375 6.875 21.2578 6.64062 21.9609 6.32812C21.4141 7.14844 20.7109 7.85156 19.9297 8.4375Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.75 8.00781C14.2109 8.00781 16.2422 10.0391 16.2422 12.5C16.2422 15 14.2109 16.9922 11.75 16.9922C9.25 16.9922 7.25781 15 7.25781 12.5C7.25781 10.0391 9.25 8.00781 11.75 8.00781ZM11.75 15.4297C13.3516 15.4297 14.6406 14.1406 14.6406 12.5C14.6406 10.8984 13.3516 9.60938 11.75 9.60938C10.1094 9.60938 8.82031 10.8984 8.82031 12.5C8.82031 14.1406 10.1484 15.4297 11.75 15.4297ZM17.4531 7.85156C17.4531 7.26562 16.9844 6.79688 16.3984 6.79688C15.8125 6.79688 15.3438 7.26562 15.3438 7.85156C15.3438 8.4375 15.8125 8.90625 16.3984 8.90625C16.9844 8.90625 17.4531 8.4375 17.4531 7.85156ZM20.4219 8.90625C20.5 10.3516 20.5 14.6875 20.4219 16.1328C20.3438 17.5391 20.0312 18.75 19.0156 19.8047C18 20.8203 16.75 21.1328 15.3438 21.2109C13.8984 21.2891 9.5625 21.2891 8.11719 21.2109C6.71094 21.1328 5.5 20.8203 4.44531 19.8047C3.42969 18.75 3.11719 17.5391 3.03906 16.1328C2.96094 14.6875 2.96094 10.3516 3.03906 8.90625C3.11719 7.5 3.42969 6.25 4.44531 5.23438C5.5 4.21875 6.71094 3.90625 8.11719 3.82812C9.5625 3.75 13.8984 3.75 15.3438 3.82812C16.75 3.90625 18 4.21875 19.0156 5.23438C20.0312 6.25 20.3438 7.5 20.4219 8.90625ZM18.5469 17.6562C19.0156 16.5234 18.8984 13.7891 18.8984 12.5C18.8984 11.25 19.0156 8.51562 18.5469 7.34375C18.2344 6.60156 17.6484 5.97656 16.9062 5.70312C15.7344 5.23438 13 5.35156 11.75 5.35156C10.4609 5.35156 7.72656 5.23438 6.59375 5.70312C5.8125 6.01562 5.22656 6.60156 4.91406 7.34375C4.44531 8.51562 4.5625 11.25 4.5625 12.5C4.5625 13.7891 4.44531 16.5234 4.91406 17.6562C5.22656 18.4375 5.8125 19.0234 6.59375 19.3359C7.72656 19.8047 10.4609 19.6875 11.75 19.6875C13 19.6875 15.7344 19.8047 16.9062 19.3359C17.6484 19.0234 18.2734 18.4375 18.5469 17.6562Z" fill="white"></path></svg>
                                </div>
                                <div className="h-[4vh] w-[4vh] flex justify-center items-center bg-slate-800 bg-cover rounded hover:-mt-2 hover:bg-slate-700 duration-500">
                                <svg width="2.5vh" height="2.5vh" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.5 5C20.2031 5.02604 20.7891 5.27344 21.2578 5.74219C21.7266 6.21094 21.974 6.79688 22 7.5V17.5C21.974 18.2031 21.7266 18.7891 21.2578 19.2578C20.7891 19.7266 20.2031 19.974 19.5 20H4.5C3.79688 19.974 3.21094 19.7266 2.74219 19.2578C2.27344 18.7891 2.02604 18.2031 2 17.5V7.5C2.02604 6.79688 2.27344 6.21094 2.74219 5.74219C3.21094 5.27344 3.79688 5.02604 4.5 5H19.5ZM4.5 6.875C4.10938 6.90104 3.90104 7.10938 3.875 7.5V8.35938L10.3984 13.75C10.8672 14.1406 11.401 14.3359 12 14.3359C12.599 14.3359 13.1328 14.1406 13.6016 13.75L20.125 8.35938V7.5C20.099 7.10938 19.8906 6.90104 19.5 6.875H4.5ZM19.5 18.125C19.8906 18.099 20.099 17.8906 20.125 17.5V10.8203L14.8125 15.2344C13.9792 15.9115 13.0417 16.25 12 16.25C10.9583 16.25 10.0208 15.9115 9.1875 15.2344L3.875 10.8203V17.5C3.90104 17.8906 4.10938 18.099 4.5 18.125H19.5Z" fill="white"></path></svg>
                                </div>
                            </div>
                    </div>
                    </div>
                </div>
                </div>
            </div>
            </div>
    );
}
